//Задача: Написать программу, которая из имеющегося массива строк 
//формирует новый массив из строк, длина которых меньше, либо равна 3 символам. 
//Первоначальный массив можно ввести с клавиатуры, либо задать на старте выполнения алгоритма.


string[] array = { "H", "e", "l", "l", "o" };
int count = 3;
for (int i = 0; i < count; i++)
{
    Console.Write($"{array[i]} ");
}







